; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (next-num ?numA - num ?numB - num) 
    (in-carrier ?crate - crate ?carrier - carrier)
    (crates-in-carrier ?carrier - carrier ?n - num)
    (carrier-capacity ?carrier - carrier ?n - num)
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?n_current - num
        ?n_next - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_current ?n_next)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_next)
        (in-carrier ?crate ?carrier)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?person - person
        ?content - content 
        ?n_current - num
        ?n_prev - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (in-carrier ?crate ?carrier)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_prev ?n_current)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_prev)
        (not (in-carrier ?crate ?carrier))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l5_p5_c5_g5_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	carrier1 - carrier
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(carrier-at carrier1 depot)
	(carrier-capacity carrier1 N4)
	(crates-in-carrier carrier1 N0)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate medicine crate5)
	(person-at person1 loc1)
	(person-at person2 loc4)
	(person-at person3 loc1)
	(person-at person4 loc5)
	(person-at person5 loc4)
	(next-num N0 N1)
	(next-num N1 N2)
	(next-num N2 N3)
	(next-num N3 N4)
	(next-num N4 N5)
	(next-num N5 N6)
	(next-num N6 N7)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person5 food)
))
)

; plan
1. (put-crate-in-carrier crate3 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate3 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate3 carrier1)
   goals met: 1 of 6
2. (put-crate-in-carrier crate4 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate4 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate4 carrier1)
   goals met: 1 of 6
3. (put-crate-in-carrier crate2 depot drone1 carrier1 n2 n3)
   deleted: (crates-in-carrier carrier1 n2) (crate-at crate2 depot)
   added: (crates-in-carrier carrier1 n3) (in-carrier crate2 carrier1)
   goals met: 1 of 6
4. (put-crate-in-carrier crate5 depot drone1 carrier1 n3 n4)
   deleted: (crates-in-carrier carrier1 n3) (crate-at crate5 depot)
   added: (crates-in-carrier carrier1 n4) (in-carrier crate5 carrier1)
   goals met: 1 of 6
5. (put-crate-in-carrier crate1 depot drone1 carrier1 n4 n5)
   deleted: (crates-in-carrier carrier1 n4) (crate-at crate1 depot)
   added: (crates-in-carrier carrier1 n5) (in-carrier crate1 carrier1)
   goals met: 1 of 6
6. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 0 of 6
7. (pick-and-drop crate4 loc4 drone1 carrier1 person5 food n5 n4)
   deleted: (crates-in-carrier carrier1 n5) (in-carrier crate4 carrier1)
   added: (crates-in-carrier carrier1 n4) (has-content-person person5 food)
   goals met: 1 of 6
8. (move-carrier loc4 loc1 drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 1 of 6
9. (pick-and-drop crate5 loc1 drone1 carrier1 person1 medicine n4 n3)
   deleted: (crates-in-carrier carrier1 n4) (in-carrier crate5 carrier1)
   added: (crates-in-carrier carrier1 n3) (has-content-person person1 medicine)
   goals met: 2 of 6
10. (pick-and-drop crate1 loc1 drone1 carrier1 person3 food n3 n2)
   deleted: (crates-in-carrier carrier1 n3) (in-carrier crate1 carrier1)
   added: (crates-in-carrier carrier1 n2) (has-content-person person3 food)
   goals met: 3 of 6
11. (pick-and-drop crate2 loc1 drone1 carrier1 person1 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate2 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person1 food)
   goals met: 4 of 6
12. (move-carrier loc1 loc5 drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 4 of 6
13. (pick-and-drop crate3 loc5 drone1 carrier1 person4 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate3 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person4 food)
   goals met: 5 of 6
14. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 6
